"""Variables or values for testing."""

match_reading_tests = [
    ['これから', 'これから', 'これから'],
    ['行く', 'いく', '行[い]@く'],
    ['青い', 'あおい', '青[あお]@い'],
    ['学校', 'がっこう', '学校[がっこう]@'],
    ['思い出', 'おもいで', '思[おも]@い#出[で]@'],
    ['青い空', 'あおいそら', '青[あお]@い#空[そら]@'],
    ['加わる', 'くわわる', '加[くわ]@わる'],
    ['いつか生まれ変わる', 'いつかうまれかわる', 'いつか#生[う]@まれ#変[か]@わる'],
    ['おはよう', 'さよなら', 'さよなら'],
    ['どこから', 'ぼくら', 'どこから'],
    ['悲しい', 'ぜつぼう', 'ぜつぼう'],
    ['今日の天気は晴れです。どこに行きたいんですか', 'きょうのてんきははれです。どこにいきたいんですか', '今日[きょう]@の#天気[てんき]@は#晴[は]@れです。どこに#行[い]@きたいんですか'],
    ['嬉しい', '嬉しい', '嬉しい'],
    ['どこにいても何になるの', 'どこにいても', 'どこにいても何になるの'],
    ['ずっと前から', 'まえから', 'ずっと前から']
]

kanaize = [
    ['konnnichihasekai', False, 'こんにちはせかい'],
    ['subashikkoichaironokitsunehanoromanainuwotobikoeta', False, 'すばしっこいちゃいろのきつねはのろまないぬをとびこえた'],
    ['jankenpon', False, 'じゃんけんぽん'],
    ['jyankenpon', False, 'じゃんけんぽん'],
    ['puroguramingu', True, 'プログラミング'],
    ['ko-hi-', True, 'コーヒー']
]

# number, use kanji, decimal limit, separator, minus sign, result
japanize_kana = [
    [0, False, 0, '', None, 'ゼロ'],
    [200, False, 0, '', None, 'にひゃく'],
    [524, False, 0, '', None, 'ごひゃくにじゅうよん'],
    [618, False, 0, '', None, 'ろっぴゃくじゅうはち'],
    [3907, False, 0, '', None, 'さんぜんきゅうひゃくなな'],
    [5301, False, 0, '#', None, 'ご#せん#さんびゃく#いち'],
    [43076, False, 0, '|', None, 'よん|まん|さんぜん|なな|じゅう|ろく'],
    [706249222, False, 0, '', None, 'ななおくろっぴゃくにじゅうよんまんきゅうせんにひゃくにじゅうに'],
    [500000000020001, False, 0, '', None, 'ごひゃくちょうにまんいち']
]
japanize_kanji = [
    [0, True, 0, '', None, '零'],
    [524, True, 0, '#', None, '五#百#二#十#四'],
    [618, True, 0, '', None, '六百十八'],
    [3907, True, 0, '#', None, '三千#九#百#七'],
    [5301, True, 0, '', None, '五千三百一'],
    [43076, True, 0, '', None, '四万三千七十六'],
    [706249222, True, 0, '', None, '七億六百二十四万九千二百二十二'],
    [500000000020001, True, 0, '', None, '五百兆二万一']
]
japanize_minus = [
    [-2, True, 0, '', None, 'マイナス二'],
    [-524, False, 0, '#', None, 'マイナス#ご#ひゃく#に#じゅう#よん'],
    [-8437, False, 0, '', '-', '-はっせんよんひゃくさんじゅうなな']
]
japanize_decimals = [
    [0.3, True, 1, '', None, '零点三'],
    [0.456, False, 2, '', None, 'ゼロてんよんご'],
    [-251.443, False, 5, '', None, 'マイナスにひゃくごじゅういちてんよんよんさん'],
    [3.141592653589793, False, 5, '', None, 'さんてんいちよんいちごきゅう']
]